### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # module.kubernetes_addons.module.argocd[0].helm_release.argocd_application["addons"] will be updated in-place
!   resource "helm_release" "argocd_application" {
        id                         = "addons"
        name                       = "addons"
        # (27 unchanged attributes hidden)

-       set {
-           name  = "source.helm.values" -> null
-           type  = "auto" -> null
-           value = <<-EOT
                "account": "484752921218"
                "awsEfsCsiDriver":
                  "enable": true
                  "serviceAccountName": "aws-efs-csi-driver-sa"
                "clusterName": "jingood2-dev-eks"
                "region": "us-east-1"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-add-ons.git"
            EOT -> null
        }
+       set {
+           name  = "source.helm.values"
+           type  = "auto"
+           value = <<-EOT
                "account": "484752921218"
                "awsEfsCsiDriver":
                  "enable": true
                  "serviceAccountName": "aws-efs-csi-driver-sa"
                "awsLoadBalancerController":
                  "enable": true
                  "serviceAccountName": "aws-load-balancer-controller-sa"
                "clusterName": "jingood2-dev-eks"
                "region": "us-east-1"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-add-ons.git"
            EOT
        }

        # (7 unchanged blocks hidden)
    }

  # module.kubernetes_addons.module.aws_load_balancer_controller[0].aws_iam_policy.aws_load_balancer_controller will be created
+   resource "aws_iam_policy" "aws_load_balancer_controller" {
+       arn         = (known after apply)
+       description = "Allows lb controller to manage ALB and NLB"
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-lb-irsa"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "iam:CreateServiceLinkedRole"
+                       Condition = {
+                           StringEquals = {
+                               "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DescribeTargetHealth",
+                           "elasticloadbalancing:DescribeTargetGroups",
+                           "elasticloadbalancing:DescribeTargetGroupAttributes",
+                           "elasticloadbalancing:DescribeTags",
+                           "elasticloadbalancing:DescribeSSLPolicies",
+                           "elasticloadbalancing:DescribeRules",
+                           "elasticloadbalancing:DescribeLoadBalancers",
+                           "elasticloadbalancing:DescribeLoadBalancerAttributes",
+                           "elasticloadbalancing:DescribeListeners",
+                           "elasticloadbalancing:DescribeListenerCertificates",
+                           "ec2:GetCoipPoolUsage",
+                           "ec2:DescribeVpcs",
+                           "ec2:DescribeVpcPeeringConnections",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeInternetGateways",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeCoipPools",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:DescribeAddresses",
+                           "ec2:DescribeAccountAttributes",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action   = [
+                           "wafv2:GetWebACLForResource",
+                           "wafv2:GetWebACL",
+                           "wafv2:DisassociateWebACL",
+                           "wafv2:AssociateWebACL",
+                           "waf-regional:GetWebACLForResource",
+                           "waf-regional:GetWebACL",
+                           "waf-regional:DisassociateWebACL",
+                           "waf-regional:AssociateWebACL",
+                           "shield:GetSubscriptionState",
+                           "shield:DescribeProtection",
+                           "shield:DeleteProtection",
+                           "shield:CreateProtection",
+                           "iam:ListServerCertificates",
+                           "iam:GetServerCertificate",
+                           "cognito-idp:DescribeUserPoolClient",
+                           "acm:ListCertificates",
+                           "acm:DescribeCertificate",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action   = [
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action   = "ec2:CreateSecurityGroup"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "ec2:DeleteTags",
+                           "ec2:CreateTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/ingress.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:DeleteTargetGroup",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/ingress.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "ec2:DeleteTags",
+                           "ec2:CreateTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:DeleteSecurityGroup",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:CreateTargetGroup",
+                           "elasticloadbalancing:CreateLoadBalancer",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DeleteRule",
+                           "elasticloadbalancing:DeleteListener",
+                           "elasticloadbalancing:CreateRule",
+                           "elasticloadbalancing:CreateListener",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
+                       Sid       = ""
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RemoveTags",
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
+                       Sid      = ""
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:SetSubnets",
+                           "elasticloadbalancing:SetSecurityGroups",
+                           "elasticloadbalancing:SetIpAddressType",
+                           "elasticloadbalancing:ModifyTargetGroupAttributes",
+                           "elasticloadbalancing:ModifyTargetGroup",
+                           "elasticloadbalancing:ModifyLoadBalancerAttributes",
+                           "elasticloadbalancing:DeleteTargetGroup",
+                           "elasticloadbalancing:DeleteLoadBalancer",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RegisterTargets",
+                           "elasticloadbalancing:DeregisterTargets",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
+                       Sid      = ""
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:SetWebAcl",
+                           "elasticloadbalancing:RemoveListenerCertificates",
+                           "elasticloadbalancing:ModifyRule",
+                           "elasticloadbalancing:ModifyListener",
+                           "elasticloadbalancing:AddListenerCertificates",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2:aud" = "sts.amazonaws.com"
+                               "oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller-sa"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::484752921218:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account aws-load-balancer-controller-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-aws-load-balancer-controller-sa-irsa"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "jingood2-dev-eks-aws-load-balancer-controller-sa-irsa"
    }

  # module.kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0] will be created
+   resource "kubernetes_service_account_v1" "irsa" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = (known after apply)
+           generation       = (known after apply)
+           name             = "aws-load-balancer-controller-sa"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>